; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	infrared0 - mode
	infrared1 - mode
	image2 - mode
	GroundStation0 - direction
	Star2 - direction
	Star3 - direction
	GroundStation4 - direction
	GroundStation9 - direction
	GroundStation5 - direction
	Star1 - direction
	Star8 - direction
	GroundStation7 - direction
	Star6 - direction
	Star10 - direction
	Planet11 - direction
	Star12 - direction
	Planet13 - direction
	Phenomenon14 - direction
	Planet15 - direction
	Star16 - direction
	Phenomenon17 - direction
	Star18 - direction
)
(:init
	(supports instrument0 infrared1)
	(supports instrument0 infrared0)
	(supports instrument0 image2)
	(calibration_target instrument0 GroundStation5)
	(supports instrument1 infrared1)
	(supports instrument1 image2)
	(calibration_target instrument1 Star1)
	(calibration_target instrument1 GroundStation7)
	(supports instrument2 infrared1)
	(supports instrument2 image2)
	(calibration_target instrument2 Star8)
	(calibration_target instrument2 GroundStation7)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation0)
	(supports instrument3 infrared1)
	(supports instrument3 infrared0)
	(supports instrument3 image2)
	(calibration_target instrument3 Star6)
	(calibration_target instrument3 GroundStation7)
	(calibration_target instrument3 Star8)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet13)
)
(:goal (and
	(pointing satellite1 Star3)
	(have_image Star10 infrared0)
	(have_image Planet11 infrared0)
	(have_image Star12 infrared1)
	(have_image Planet13 infrared0)
	(have_image Phenomenon14 infrared1)
	(have_image Planet15 image2)
	(have_image Star16 image2)
	(have_image Phenomenon17 image2)
	(have_image Star18 infrared0)
))

)

; plan
1. (turn_to satellite1 star3 planet13)
   deleted: (pointing satellite1 planet13)
   added: (pointing satellite1 star3)
   goals met: 1 of 10
2. (turn_to satellite0 groundstation5 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 groundstation5)
   goals met: 1 of 10
3. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 1 of 10
4. (calibrate satellite0 instrument0 groundstation5)
   added: (calibrated instrument0)
   goals met: 1 of 10
5. (turn_to satellite0 planet11 groundstation5)
   deleted: (pointing satellite0 groundstation5)
   added: (pointing satellite0 planet11)
   goals met: 1 of 10
6. (take_image satellite0 planet11 instrument0 infrared0)
   added: (have_image planet11 infrared0)
   goals met: 2 of 10
7. (turn_to satellite0 phenomenon17 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 phenomenon17)
   goals met: 2 of 10
8. (take_image satellite0 phenomenon17 instrument0 image2)
   added: (have_image phenomenon17 image2)
   goals met: 3 of 10
9. (turn_to satellite0 phenomenon14 phenomenon17)
   deleted: (pointing satellite0 phenomenon17)
   added: (pointing satellite0 phenomenon14)
   goals met: 3 of 10
10. (take_image satellite0 phenomenon14 instrument0 infrared1)
   added: (have_image phenomenon14 infrared1)
   goals met: 4 of 10
11. (turn_to satellite0 planet13 phenomenon14)
   deleted: (pointing satellite0 phenomenon14)
   added: (pointing satellite0 planet13)
   goals met: 4 of 10
12. (take_image satellite0 planet13 instrument0 infrared0)
   added: (have_image planet13 infrared0)
   goals met: 5 of 10
13. (turn_to satellite0 planet15 planet13)
   deleted: (pointing satellite0 planet13)
   added: (pointing satellite0 planet15)
   goals met: 5 of 10
14. (take_image satellite0 planet15 instrument0 image2)
   added: (have_image planet15 image2)
   goals met: 6 of 10
15. (turn_to satellite0 star10 planet15)
   deleted: (pointing satellite0 planet15)
   added: (pointing satellite0 star10)
   goals met: 6 of 10
16. (take_image satellite0 star10 instrument0 infrared0)
   added: (have_image star10 infrared0)
   goals met: 7 of 10
17. (turn_to satellite0 star12 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 star12)
   goals met: 7 of 10
18. (take_image satellite0 star12 instrument0 infrared1)
   added: (have_image star12 infrared1)
   goals met: 8 of 10
19. (turn_to satellite0 star16 star12)
   deleted: (pointing satellite0 star12)
   added: (pointing satellite0 star16)
   goals met: 8 of 10
20. (take_image satellite0 star16 instrument0 image2)
   added: (have_image star16 image2)
   goals met: 9 of 10
21. (turn_to satellite0 star18 star16)
   deleted: (pointing satellite0 star16)
   added: (pointing satellite0 star18)
   goals met: 9 of 10
22. (take_image satellite0 star18 instrument0 infrared0)
   added: (have_image star18 infrared0)
   goals met: 10 of 10
